Ran Plan for project: `poc` dir: `.` workspace: `poc`

<details><summary>Show Output</summary>

```diff
/home/anson/.atlantis/repos/AnsonYe/GitOps-Atlantis-Using-Test/1/poc/poc-poc.tfplan


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_s3_bucket.bucket will be created
+ resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "terraform-hello-world-poc"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "created_by" = "terraform"
          + "workspace"  = "poc"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ bucket_name = "terraform-hello-world-poc"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p poc`
* :put_litter_in_its_place: To **delete** this plan click [here](https://186d-122-218-156-179.ngrok-free.app/lock?id=AnsonYe%252FGitOps-Atlantis-Using-Test%252F.%252Fpoc)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p poc`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`